//============================================================================================================
//
//君をたずねてにゃん千里[goal.h]
//Author:Kishimoto Eiji
//
//============================================================================================================
#ifndef _GOAL_H_
#define _GOAL_H_

#include "main.h"

//============================================================================================================
//マクロ定義
//============================================================================================================
#define GOAL_WIDTH			(60)	//ゴールの幅
#define GOAL_HEIGHT			(60)	//ゴールの高さ
#define GOAL_MAX_PATTERN	(4)		//ゴールの最大パターン数
#define GOAL_ANIM_SPEED		(10)	//ゴールのアニメーションスピード


//============================================================================================================
//ゴール構造体の定義
//============================================================================================================
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 move;	//移動量
	float fWidth;		//幅
	float fHeight;		//高さ
	int nCntAnim;		//カウンター
	int nPtnAnim;		//パターン番号
	bool bUse;			//使用しているかどうか
}GOAL;

//============================================================================================================
//プロトタイプ宣言
//============================================================================================================
void InitGoal(void);
void UninitGoal(void);
void UpdateGoal(void);
void DrawGoal(void);
void SetGoal(D3DXVECTOR3 pos);
bool GetGoal(void);
bool GetPosGoal(void);

#endif