//============================================================================================================
//
//君をたずねてにゃん千里[item.h]
//Author:Kishimoto Eiji
//
//============================================================================================================
#ifndef _ITEM_H_
#define _ITEM_H_

#include "main.h"

//============================================================================================================
//マクロ定義
//============================================================================================================
#define MAX_ITEM		(42)		//アイテムの最大数
#define ITEM_WIDTH		(40)		//アイテムの幅
#define ITEM_HEIGHT		(40)		//アイテムの高さ
#define ITEM_MOVE		(-3.0f)		//アイテムの移動量(MapSet用)

//============================================================================================================
//アイテムの種類
//============================================================================================================
typedef enum
{
	ITEM_TYPE_COIN = 0,		//コイン
	ITEM_TYPE_MAX
}ITEM_TYPE;

//============================================================================================================
//プレイヤー構造体の定義
//============================================================================================================
typedef struct
{
	D3DXVECTOR3 pos;		//位置
	D3DXVECTOR3 move;		//移動量
	float fWidth;			//幅
	float fHeight;			//高さ
	int nCounter;			//カウンター
	ITEM_TYPE type;			//アイテムの種類
	bool bUse;				//使用されているかどうか
}Item;

//============================================================================================================
//プロトタイプ宣言
//============================================================================================================
void InitItem(void);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);
void SetItem(D3DXVECTOR3 pos, D3DXVECTOR3 move, ITEM_TYPE itemType);
void CollisionItem(D3DXVECTOR3 *pPos, float fWidth, float fHeight);
Item *GetItem(void);

#endif // !_item_H_