//============================================================================================================
//
//君をたずねてにゃん千里[title.h]
//Author:Kishimoto Eiji
//
//============================================================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "main.h"

//============================================================================================================
//マクロ定義
//============================================================================================================
#define PRESSENTER_POS_X		(640.0f)	//PressEnterの位置(X)
#define PRESSENTER_POS_Y		(600.0f)	//PressEnterの位置(Y)
#define PRESSENTER_WIDTH		(240.0f)	//PressEnterの幅
#define PRESSENTER_HEIGHT		(70.0f)		//PressEnterの高さ
#define PRESSENTER_SPEED		(0.015f)	//PressEnterの点滅スピード(通常)
#define PRESSENTER_HIGHSPEED	(0.4f)		//PressEnterの点滅スピード(高速)
#define LOGO_WIDTH				(450.0f)	//タイトルロゴの幅
#define LOGO_HEIGHT				(330.0f)	//タイトルロゴの高さ
#define LOGO_SPEED				(3.0f)		//タイトルロゴのスピード

//============================================================================================================
//タイトルロゴの状態
//============================================================================================================
typedef enum
{
	TITLELOGO_POP = 0,	//出現状態
	TITLELOGO_NORMAL,	//通常状態
	TITLELOGO_MAX
}TITLELOGO;

//============================================================================================================
//Enterロゴのフェード状態
//============================================================================================================
typedef enum
{
	FADEENTER_IN = 0,		//透明にする
	FADEENTER_OUT,			//不透明にする
	FADEENTER_MAX
}FADEENTER;

//============================================================================================================
//Press Enterの構造体の定義
//============================================================================================================
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXCOLOR col;		//色
}PressEnter;

//============================================================================================================
//プロトタイプ宣言
//============================================================================================================
void InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif