//================================================
//
//3Dゲーム(仮)[number.cpp]
//Author:Kishimoto Eiji
//
//================================================
//***************************
//インクルード
//***************************
#include "number.h"

#include <assert.h>

//***************************
//定数の定義
//***************************
const float CNumber::POS_X = 980.0f;			//位置( X )
const float CNumber::POS_Y = 640.0f;			//位置( Y )
const float CNumber::NUMBER_WIDTH = 60.0f;		//横幅
const float CNumber::NUMBER_HEIGHT = 100.0f;	//縦幅

//================================================
//生成
//================================================
CNumber* CNumber::Create()
{
	CNumber* pNumber = nullptr;	//ポインタ

	if (pNumber != nullptr)
	{//NULLチェック
		assert(false);
	}

	/* nullptrの場合 */

	pNumber = new CNumber;	//メモリの動的確保

	pNumber->Init();	//初期化

	return pNumber;	//動的確保したものを返す
}

//================================================
//コンストラクタ
//================================================
CNumber::CNumber()
{
	//タイプの設定
	CObject::SetObjType(CObject::OBJ_TYPE::NUMBER);
}

//================================================
//デストラクタ
//================================================
CNumber::~CNumber()
{
}

//================================================
//初期化
//================================================
HRESULT CNumber::Init()
{
	CObject2D::Init();	//親クラス
	
	return S_OK;
}

//================================================
//終了
//================================================
void CNumber::Uninit()
{
	CObject2D::Uninit();	//親クラス
}

//================================================
//更新
//================================================
void CNumber::Update()
{
	CObject2D::Update();	//親クラス
}

//================================================
//描画
//================================================
void CNumber::Draw()
{
	CObject2D::Draw();	//親クラス
}